In [1]:
import pandas as pd

In [2]:
attempt_murder_data = pd.read_csv('CSV Files/attempted_murder.csv')
attempt_murder_data.head()

,Police_Station,Year,Type,Date,Month,Day,Time,Hour
0,Jayanagar,2016,Attempted Murder,02/10/2016,10,2,07:00:00,7
1,Jayanagar,2016,Attempted Murder,11/09/2016,9,11,13:30:00,13
2,Jayanagar,2017,Attempted Murder,06/12/2017,12,6,22:15:00,22
3,Jayanagar,2017,Attempted Murder,12/02/2018,2,12,23:50:00,23
4,Jayanagar,2017,Attempted Murder,02/01/2015,1,2,07:35:00,7

In [16]:
chain_snatching_data = pd.read_csv('CSV Files/Chain_Snatching.csv')
chain_snatching_data.head()

,Police_Station,Year,Type,Date,Month,Day,Time,Hour
0,Jayanagar,2015,Chain Snatching,03/02/2015,2,3,15:40:00,15.0
1,Jayanagar,2015,Chain Snatching,13/03/2015,3,13,17:30:00,17.0
2,Jayanagar,2015,Chain Snatching,31/03/2015,3,31,20:15:00,20.0
3,Jayanagar,2015,Chain Snatching,04/01/2015,1,4,19:45:00,19.0
4,Jayanagar,2015,Chain Snatching,05/08/2015,8,5,11:30:00,11.0

In [17]:
chain_snatching_data.head()

,Police_Station,Year,Type,Date,Month,Day,Time,Hour
0,Jayanagar,2015,Chain Snatching,03/02/2015,2,3,15:40:00,15.0
1,Jayanagar,2015,Chain Snatching,13/03/2015,3,13,17:30:00,17.0
2,Jayanagar,2015,Chain Snatching,31/03/2015,3,31,20:15:00,20.0
3,Jayanagar,2015,Chain Snatching,04/01/2015,1,4,19:45:00,19.0
4,Jayanagar,2015,Chain Snatching,05/08/2015,8,5,11:30:00,11.0

In [19]:
chain_snatching_data['Hour'].fillna(value=14, inplace = True)

In [22]:
chain_snatching_data['Hour'] = chain_snatching_data['Hour'].astype('int64')

In [23]:
chain_snatching_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 360 entries, 0 to 359
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Police_Station  360 non-null    object
 1   Year            360 non-null    int64
 2   Type            360 non-null    object
 3   Date            360 non-null    object
 4   Month           360 non-null    int64
 5   Day             360 non-null    int64
 6   Time            336 non-null    object
 7   Hour            360 non-null    int64
dtypes: int64(4), object(4)
memory usage: 22.6+ KB

In [24]:
chain_snatching_data.head()

,Police_Station,Year,Type,Date,Month,Day,Time,Hour
0,Jayanagar,2015,Chain Snatching,03/02/2015,2,3,15:40:00,15
1,Jayanagar,2015,Chain Snatching,13/03/2015,3,13,17:30:00,17
2,Jayanagar,2015,Chain Snatching,31/03/2015,3,31,20:15:00,20
3,Jayanagar,2015,Chain Snatching,04/01/2015,1,4,19:45:00,19
4,Jayanagar,2015,Chain Snatching,05/08/2015,8,5,11:30:00,11

In [25]:
fourWheeler_data = pd.read_csv('CSV Files/four_wheeler_theft.csv')
fourWheeler_data.head()

,Police_Station,Year,Type,Date,Month,Day,Time,Hour
0,Jayanagar,2015,4 Wheeler Theft,01/05/2015,5,1,18:40:00,18.0
1,Jayanagar,2015,4 Wheeler Theft,02/06/2015,6,2,13:00:00,13.0
2,Jayanagar,2015,4 Wheeler Theft,09/04/2015,4,9,13:30:00,13.0
3,Jayanagar,2015,4 Wheeler Theft,20/11/2015,11,20,17:30:00,17.0
4,Jayanagar,2015,4 Wheeler Theft,12/08/2015,8,12,17:15:00,17.0

In [26]:
fourWheeler_data.describe()

              Year       Month         Day        Hour
count   216.000000  216.000000  216.000000  190.000000
mean   2016.907407    6.444444   15.467593   14.005263
std       1.456578    3.460967    8.326973    4.363748
min    2015.000000    1.000000    1.000000    0.000000
25%    2016.000000    3.000000    9.000000   11.000000
50%    2017.000000    6.000000   15.000000   13.000000
75%    2018.000000   10.000000   21.250000   18.000000
max    2019.000000   12.000000   31.000000   23.000000

In [27]:
fourWheeler_data['Hour'].fillna(value=14, inplace = True)

In [28]:
fourWheeler_data['Hour'] = fourWheeler_data['Hour'].astype('int64')

In [29]:
fourWheeler_data.head()

,Police_Station,Year,Type,Date,Month,Day,Time,Hour
0,Jayanagar,2015,4 Wheeler Theft,01/05/2015,5,1,18:40:00,18
1,Jayanagar,2015,4 Wheeler Theft,02/06/2015,6,2,13:00:00,13
2,Jayanagar,2015,4 Wheeler Theft,09/04/2015,4,9,13:30:00,13
3,Jayanagar,2015,4 Wheeler Theft,20/11/2015,11,20,17:30:00,17
4,Jayanagar,2015,4 Wheeler Theft,12/08/2015,8,12,17:15:00,17